# 1
# Написать программу, которая получает имя и возраст пользователя, проверяет, что возраст 18 лет и старше
# и выдает приветсвенное сообщение в зависимости от возраста. Примеры работы:
# Имя Иван, возраст 34 -> "Приветсвую, Иван! У вас есть доступ к взрослому контенту."
# Имя Лиза, возраст 15 -> "Приветсвую, Лиза! У вас нет доступа к взрослому контенту."
# Имя Артем, возраст 18 -> "Приветсвую, Артем! Поздравляю с совершеннолетием! У вас нет доступа к взрослому контенту."
# name = input('Enter your name: ')
# age = int(input('Enter you age: '))
# if age > 18:
#     print(f'"Приветсвую {name}! У вас есть доуступ к взрослому контенту."')
# elif age < 18:
#     print(f'"Приветсвую {name}! У вас нет доуступ к взрослому контенту."')
# else:
#     print(f'"Приветсвую {name}! Поздравляю с совершеннолетием! '
#           f'У вас нет доуступ к взрослому контенту."')
# 2*
# Пользователь вводит две строки. Нужно вывести True, если в обеих строках использовались одинаковые символы,
# и False иначе. Постараться решить, не используя циклы.
# Примеры работы:
# "abc" и "bca" -> True
# "aabc" и "abc" -> True
# "Abc" и "abc" -> False
# "abc" и "aaa" -> False
my_str = input('Enter first string: ')
my_str2 = input('Enter second string: ')
if set(my_str) == set(my_str2):
    print(f'"{my_str}" и "{my_str2}" -> {set(my_str) == set(my_str2)}')
else:
    print(f'"{my_str}" и "{my_str2}" -> {set(my_str) == set(my_str2)}')
# 3*
# Написать мини-игру «Камень ножницы бумага с ботом», в которой пользователь должен выбрать либо камень,
# либо ножницы, либо бумагу. Бот делает случайный выбор (случайное число).
# Вывести результат если, например, игрок выбрал бумагу, а бот ножницы:
# Бот выбрал ножницы, вы проиграли!
# Подсказка: я не показывала, как в Pyhon получить случайное число, попробуйте найти это сами