''' Получение суммы, разности,  произведения, возведение переменной в степень, деление по модулю,
 осуществить целочисленное делени '''

num_a, num_b = int(input('Enter first integer number:\n')), int(input('Enter second integer number:\n'))

# присовение переменной суммы двух переменных, вывод результата на печать
my_sum = num_a + num_b
print(f'Сумма чисел a и b = {my_sum}')

# присовение переменной разности двух переменных, вывод результата на печать
difference = num_a - num_b
print(f'Разность чисел a и b = {difference}')

# присовение переменной произведения двух переменных, вывод результата на печать
multiplic = num_a * num_b
print(f'Произведение чисел a и b = {multiplic}')

#Возведение в степень вывод на печать
exponentiation = num_a ** num_b
exponentiation_two = pow(num_a, num_b)
print(f'А в степение В = {exponentiation}')
print(f'А в степение В = {exponentiation_two}')

# Деление первого числа на второе
divide = num_a / num_b
print(f'А разделить на Б = {divide}')

# Целочисленное деление чиссел
#int_divide = num_a // num_b
print(f'Целоисленное число по результатам деления А на В = {num_a // num_b}')

# Получение остатка от деления
print(f'Остаток от деления А на Б = {num_a % num_b}')

'''Установление приоритета в вырожении с помощью выделения операций скобками'''
# Первый пример
x = 17 / 2 * 3 + 2
vers_x = (((17 / 2) * 3) + 2)
print(f'Значение х до установки скобок {x}, значение после {vers_x} x = vers_x {x == vers_x}')

# Второй пример
x = 2 + 17 / 2 * 3
vers_x = (2 + ((17 / 2) * 3))
print(f'Значение х до установки скобок {x}, значение после {vers_x} x = vers_x {x == vers_x}')

#Третий пример
x = 19 % 4 + 15 / 2 * 3
vers_x = ((19 % 4) + ((15 / 2) * 3))
print(f'Значение х до установки скобок {x}, значение после {vers_x} x = vers_x {x == vers_x}')

# Четвертый пример
x = (15 + 6) - 10 * 4
vers_x = ((15 + 6) - (10 * 4))
print(f'Значение х до установки скобок {x}, значение после {vers_x} x = vers_x {x == vers_x}')

# Пятый пример
x = 17 / 2 % 2 * 3 ** 3
vers_x = (((17 / 2) % 2) * (3 ** 3))
print(f'Значение х до установки скобок {x}, значение после {vers_x} x = vers_x {x == vers_x}')

''' Поучение значения на основании двух действительных чисел по формуле (|x| - |y|) / 1 + |x * y|'''
num_x = int(input('Enter x : \n'))
num_y = int(input('Enter y: \n'))
result = (abs(num_x) - abs(num_y)) / (1 + abs(num_x * num_y))
print(f'(|{num_x}| - |{num_y}|) / (1 + |{num_x} * {num_y}|) = {result}')
