## Пусть у нас есть массив чисел numbers = [3, 5, 2, 6, 8].
# Нужно вывести сумму первого и последнего элементов массива.
# массива
# numbers = [3, 5, 2, 6, 8]
# result = numbers[0] + numbers[-1]
# print(f'Сумма первого и последнего элемента = {result}')


# Пусть у нас есть массив слов pets = ["cat", "dog", "fish", "hamster", "parrot"].
# Нужно вывести в консоль второе и четвертое слово через запятую.
# pets = ["cat", "dog", "fish", "hamster", "parrot"]
# print(f'{pets[1]}, {pets[3]}')






#*5.
# Пусть в программе хранится список друзей:
# friends = ['Egor', 'Liza', 'Vanya', 'Yana']
# При запуске программа просит ввести имя, и проверяет, есть ли оно в списке.
# Если есть, вывести сообщение 'У меня есть друг <имя>',
# если нет, вывести 'У меня нет друга с именем <имя>'.
friends = ['Egor', 'Liza', 'Vanya', 'Yana']
name = input('Введите имя друга: ')
if name in friends:
    print(f'У меня есть друг {name}')
else:
    print(f'У меня нет друга с именем {name} \nДобавить новое Имя {name} в список друзей')
    answer = input('y\\n')
    if answer == 'y':
        friends.append(name)
        print(f'Обновленный список друзеей {friends}')
    else:
        print('Приятного дня')


